( Windows-константы, необходимые при в/в.
)


0x80000000 CONSTANT R/O ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "только для чтения"

0x40000000 CONSTANT W/O ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "только для записи"


0xC0000000 CONSTANT R/W ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "чтение/запись"

DECIMAL


\ 7 CONSTANT ZZZ
