; --------------------------------------------------------
; KJ|ABuIIIA  0.9
; --------------------------------------------------------
; Клавиатурный тренажёр для операционной системы Колибри.
;
; Разработчики:
; - Андрей Михайлович (Dron2004)
;
; Последние изменения в исходном коде: 24.07.2010 21:15 GMT+6


 use32
 org 0x0

 ;Заголовок
 db 'MENUET01'
 dd 0x01
 dd START
 dd I_END
 dd 0x10000
 dd 0x10000
 dd params
 dd 0x0

;Код программы
START:

      ; call get_screen_params

	mov eax, 0x0000001C
	cmp eax, 0x0
	je start_with_internal_text  ; Параметры не заданы

	; Параметр задан! Пытаемся этим воспользоваться
	; Необходимо определить размер файла... Вперёд!!!
	mov eax, 5
	mov [arg1], eax
	xor eax, eax
	mov [arg2], eax
	mov [arg3], eax
	mov [arg4], eax
	mov eax, filedatastruct
	mov [arg5], eax
	mov eax, [0x0000001C]
	mov [arg7], eax

	mov eax, 70;
	mov ebx, filestruct
	int 0x40

	cmp eax, 0
	jne start_with_internal_text  ;Ошибка

	mov eax, dword [size]
	mov [filesize], eax  ;теперь размер файла у нас в filesize

	;Инициализируем кучу

	mov eax, 68
	mov ebx, 11
	int 0x40

	cmp eax, 0x0
	je start_with_internal_text   ;Ошибка

	;Выделяем блок памяти под файл
	mov eax, 68
	mov ebx, 12
	mov ecx, [filesize]
	inc ecx  ;Выделим дополнительно один байт для того, чтобы добавить 0xFF
		 ;защита от "битых" KLA-файлов
	int 0x40

	mov [datastart], eax	;В переменной ДатаСтарт теперь находится указатель

	add eax, [filesize]
	mov bh, 0xFF
	mov [eax], bh

	;Собственно, считываем файл в память
	mov eax, 0x00
	mov [arg1], eax   ;Номер подфункции
	mov [arg2], eax   ;Смещение в файле
	mov [arg3], eax   ;Старший dword смещения
	mov eax, [filesize]
	mov [arg4], eax   ;Размер файла
	mov eax, [datastart]
	mov [arg5], eax   ;Указатель на данные
	mov eax, par
	mov [arg7], eax   ;Указатель на ASCIIZ-строку

	mov eax, 70
	mov ebx, filestruct
	int 0x40

	cmp eax, 0x0
	jne start_with_internal_text   ;Ошибка

	;mov edx, [datastart]
       jmp initialize_variables

start_with_internal_text:
	mov edx, string
	mov [datastart], edx
	;mov edx, string         ; Используем встроенный текст

initialize_variables:




	mov edx, [datastart]
	mov [currentsymb], edx	; Начальная инициализация переменных
	mov [startline], edx
	mov [lastsymb], edx
	mov [lessonstart], edx

	mov eax, 0x00000001
	mov [currentline], eax
	call count_lines
	call draw_window


;Основной цикл
event_wait:
	mov eax, 10
	int 0x40

	cmp eax, 1  ;Перерисовка окна нужна
	je redraw
	cmp eax, 2  ;Клавиша нажата
	je key
	cmp eax, 3  ;По кнопке жмахнули
	je button

	jmp event_wait

redraw:
	call draw_window
	jmp event_wait
key:
	mov eax, 2
	int 0x40    ;Теперь код нажатой клавиши в ah

	push eax

	;Запускаем счётчик времени для последующего
	; определения скорости набора

	mov eax, [currentsymb]
	cmp eax, [lessonstart]
	jne not_first_symbol
	cmp [mistakes], 0x00
	jne not_first_symbol

	mov eax, 26
	mov ebx, 9
	int 0x40

	mov [typestarttime], eax

not_first_symbol:

	pop eax

	;Проверяем, не закончился ли текст
	mov esi, [currentsymb]
	mov al, byte [esi]
	cmp al, 0xFF
	je text_end
	cmp al, 0xFE
	je text_end

	push ebx
	mov ebx, [currentsymb]
	mov al, byte [ebx]
	pop ebx

	cmp al,0x00
	jne not_new_line
	cmp ah, 0x0D
	je correct_key_nl
	cmp ah, 0x20
	je correct_key_nl
	jmp not_this_key

not_new_line:
	cmp ah, al
	jne not_this_key
	jmp correct_key

correct_key_nl:
	mov eax, [currentsymb]
	inc eax
	mov [startline], eax

	mov eax, [currentsymb]
	inc eax
	mov [currentsymb], eax
	mov [lastsymb], eax

	mov eax, [currentline]
	inc eax
	mov [currentline], eax

	mov eax, [symbtyped]	 ;Увеличим число введённых символов на 1
	inc eax
	mov [symbtyped], eax
	call count_speed
	;call draw_speed

	call draw_window
	jmp event_wait


correct_key:
	mov eax, [currentsymb]
	inc eax
	mov [currentsymb], eax
	mov [lastsymb], eax

	mov eax, [symbtyped]	 ;Увеличим число введённых символов на 1
	inc eax
	mov [symbtyped], eax
	call count_speed
	;call draw_speed

	call redraw_2_symbols
	jmp event_wait

not_this_key:

	mov esi, [mistakes]
	inc esi
	mov [mistakes], esi
	call redraw_mistakes
	jmp event_wait

text_end:

	; /// Препятствует миганию окна по окончании урока
	; при нажатии клавиш
	mov esi, [startline]
	cmp esi, lessoncomplete
	je text_end_already_shown
	; ///////////////////////////


	call speed_to_string

	mov esi, lessoncomplete
	mov [startline], esi

	mov esi, lessoncompleteend
	dec esi
	mov [currentsymb], esi

	call draw_window
text_end_already_shown:
	jmp event_wait

button:
	mov eax, 17
	int 0x40     ;Идентификатор нажатой кнопки возвращён в ah

	cmp ah, 1    ;это кнопка закрытия
	jne no_close
	mov eax, -1
	int 0x40
no_close:
	;Проверяем остальные кнопки
	cmp ah, 0x02
	jne no_button_2
	;Нажата кнопка 2
	; ОЧЕНЬ СТРАШНЫЙ КОД
	xor eax, eax

	mov [mistakes], 0x0

	mov esi, [lastsymb]
	mov al, [esi]
	;Нужно проверить, что за символ был последним. Если 0xFF -
	;Текст кончился, нужно начать всё сначала
	cmp al, 0xFF
	je start_1st_lesson

	cmp al, 0xFE ; Мы прошли прошлый урок?
	jne not_completed_previous

init_level_after_fe:
	;Ежели да, то проверим, не попал ли случайно следующим символом 0xFF
	inc esi
	mov al, [esi]
	cmp al, 0xFF
	je start_1st_lesson
	;Ежели нет - это и есть следующий урок
	jmp set_lesson_start_from_esi

not_completed_previous:
	inc esi
	mov al, [esi]
	cmp al, 0xFF
	je start_1st_lesson
	cmp al, 0xFE
	je init_level_after_fe
	jmp not_completed_previous

start_1st_lesson:
	mov esi, [datastart]
set_lesson_start_from_esi:
	mov [startline], esi
	mov [currentsymb], esi
	mov [lastsymb], esi
	mov [lessonstart], esi

	;CC
	mov eax, 0x00000001
	mov [currentline], eax
	call count_lines
	;CC

	call reset_speed_counters

	call draw_window
	jmp event_wait
	; КОНЕЦ СТРАШНОГО КОДА

no_button_2:
	cmp ah, 0x03
	jne no_button_3

	;Перезапуск уровня
	mov edx, [lessonstart]
	mov [currentsymb], edx
	mov [startline], edx
	mov [lastsymb], edx

	mov eax, 0x00000001
	mov [currentline], eax

	mov [mistakes], 0

	call reset_speed_counters

	call count_lines
	call draw_window

	jmp event_wait

no_button_3:
	cmp ah, 0x04
	jne no_button_4

	;Перезапуск курса упражнений

	mov edx, [datastart]

	mov [lessonstart], edx
	mov [currentsymb], edx
	mov [startline], edx
	mov [lastsymb], edx

	mov eax, 0x00000001
	mov [currentline], eax

	mov [mistakes], 0


	call reset_speed_counters

	call count_lines
	call draw_window

	jmp event_wait


no_button_4:
	;И возвращаемся к ожиданию события
	jmp event_wait

;"Сердце" программы - функция рисования окна (всё остальное - туловище Ж-)) )
draw_window:
	mov eax, 12   ;Сообщаем системе о состоянии перерисовки окна
	mov ebx, 1    ;Начало перерисовки
	int 0x40


	mov ax,  [areawidth]   ;Это первый вызов draw_window?
	cmp ax, 0x0
	jne dw_not_first_call
	call get_screen_params	  ;Получаем параметры экрана - ширину и высоту

dw_not_first_call:
	xor eax, eax
	mov ax, [windowx]
	mov ecx, 65536
	mul ecx
	add eax, 780
	mov ebx, eax  ;в ebx - X и ширина

	;mov ebx, 10*65536+780

	xor eax, eax
	mov ax, [windowy]
	mov ecx, 65536
	mul ecx
	add eax, 580
	mov ecx, eax  ;в ecx - Y и высота


	;mov ecx, 10*65536+580       ;Y и высота
	mov edx, 0x33CCCCCC	     ;[тип окна][цвет рабочей области]
	mov edi, text
	mov eax, 0		     ;Определить и вывести окно
	int 0x40


;Нарисуем кнопку СЛЕДУЮЩИЙ УРОК и текст на ней
	mov eax, 8
	mov ebx, 295*65536+145
	mov ecx, 8*65536+18
	mov edx, 0x00000002
	mov esi, 0x0099CC99
	int 0x40

	mov eax, 4
	mov ebx,310*65536+14
	mov ecx, 0x80000000
	mov edx, buttontext
	int 0x40

;Нарисуем кнопку ПОВТОРИТЬ УПРАЖНЕНИЕ
	mov eax, 8
	mov ebx, 450*65536+145
	mov ecx, 8*65536+18
	mov edx, 0x00000003
	mov esi, 0x00CC9999
	int 0x40

	mov eax, 4
	mov ebx,465*65536+14
	mov ecx, 0x80000000
	mov edx, retrybuttontext
	int 0x40

;Нарисуем кнопку НАЧАТЬ КУРС ЗАНОВО
	mov eax, 8
	mov ebx, 605*65536+145
	mov ecx, 8*65536+18
	mov edx, 0x00000004
	mov esi, 0x00DD7777
	int 0x40

	mov eax, 4
	mov ebx, 626*65536+14
	mov ecx, 0x80000000
	mov edx, restartbuttontext
	int 0x40

; Нарисуем логотип
	mov eax, 65
	mov ebx, logo
	mov ecx, 32*65536+12
	mov edx, 12*65536+12
	mov esi, 1
	mov edi, green_text
	mov ebp, 0
	int 0x40

;Получим текущие параметры окна
	mov eax, 9
	mov ebx, kbbuffer
	mov ecx, -1
	int 0x40

	add ebx, 0x2A
	mov eax, [ebx]
	mov [windowwidth], eax

	mov ebx, kbbuffer
	add ebx, 0x2E
	mov eax, [ebx]
	mov [windowheight], eax

draw_error_count:
	; Нарисуем надпись "ОШИБОК"
	mov eax, 4
	mov ebx, 60*65536+15
	mov ecx, 0x80AA0000
	mov edx, mistakestext
	int 0x40

	; Выведем число ошибок
	mov eax, 47
	mov ebx, 10000000000001000000000000000000b
	mov ecx, [mistakes]
	mov edx, 105*65536+15
	mov esi, 0x00AA0000
	int 0x40

draw_line_number:
	; Нарисуем надпись "Строка       из"
	mov eax, 4
	mov ebx, 140*65536+15
	mov ecx, 0x8000AA00
	mov edx, lineistext
	int 0x40

	;Выведем номер текущей строки
	mov eax, 47
	mov ebx, 10000000000001000000000000000000b
	mov ecx, [currentline]
	mov edx, 195*65536+15
	mov esi, 0x0000AA00
	int 0x40

	;Выведем текущую строку
	mov eax, 47
	mov ebx, 10000000000001000000000000000000b
	mov ecx, [linecount]
	mov edx, 252*65536+15
	mov esi, 0x0000AA00
	int 0x40



draw_text_prepare:
	;Подготовка к выводу текста
	mov edx, 40		;Начальное положение выводимого текста по вертикали

	mov esi, [startline]
	dec esi 		;Так надо (см. *1 ниже)!
	mov ebx, esi		;Теперь в edx - начало выводимой строки


draw_text:


	;Наращиваем указатель на текущий символ на единицу
	inc ebx 	  ;(*1)

draw_text_without_inc:
	;Посмотрим, не выходит ли текст за границу окна
	mov esi, [windowheight] ;Теперь в esi размер окна
	mov eax, edx
	and eax,0x0000FFFF
	add eax, 64
	cmp eax, esi
	ja end_draw_text     ;Мы выходим за пределы окна. Перестаём рисовать.

	;установим положение по горизонтали (+18 к текущей позиции)
	mov esi, 18*65536

	add edx, esi

	; посмотрим, не вышел ли текст за границу по горизонтали
	; если вышел - не рисуем этот кусок
	mov esi, [windowwidth] ;Теперь в esi размер окна
	shl esi, 16
	mov eax, edx
	and eax,0xFFFF0000
	add eax, 40*65536
	cmp eax, esi
	jna horizontal_check_ok     ;Если eax>est, то мы выходим за пределы окна.

skip_line_end_step:

	mov ah, byte [ebx]

	cmp ah, 0x00
	je end_line_to_next_line
	cmp ah, 0xFE
	je end_draw_text
	cmp ah, 0xFF
	je end_draw_text

	inc ebx

	jmp skip_line_end_step

end_line_to_next_line:
	;jmp end_line_to_next_line
	and edx, 0x0000FFFF
	jmp draw_text_without_inc

horizontal_check_ok:

	;Проверим, не закончился ли урок
	mov esi, [startline]
	cmp esi, lessoncomplete
	jne in_process

	;Если закончился, текст выводить нужно ЗЕЛЕНЫМ ЦВЕТОМ
	mov edi, green_text
	jmp color_set_sucessful

in_process:
	cmp ebx, [currentsymb]	  ; Рисуется текущий набираемый символ?
	je red			  ; Так точно!

	ja black		  ; Нет, Рисуется то, что мы ещё не набрали


	mov edi, gray_text	 ; Нет, рисуется то, что мы уже набрали
	jmp color_set_sucessful

red:
	mov edi, red_text
	jmp color_set_sucessful

black:
	mov edi, black_text	 ;Шрифт и цвет

color_set_sucessful:
	xor esi,esi
	movzx si, byte [ebx]
	cmp si, 0x0000
	jne continue_drawing
	call increase_y;
	jmp continue_text_proc

continue_drawing:

	cmp si, 0x00FF
	je end_draw_text
	cmp si, 0x00FE
	je end_draw_text


	;Рисуем букву с помощью БОЛЬШОГО шрифта
	push ebx
	push edx

	movzx eax, byte [ebx]
	mov ecx, 64
	mul ecx
	add eax, big_font
	mov ebx, eax

	pop edx

	mov ecx, 16*65536+32

	; В edx лежит координата

	mov esi, 1

	; В edi лежит указатель на палитру (цвет шрифта)

	mov ebp, 0

	mov eax, 65

	int 0x40

	pop ebx
	;На этом отрисовка буквы завершена
continue_text_proc:
	;inc edi
	jmp draw_text

end_draw_text:

	mov eax, 12   ;Вновь сообщаем о состоянии перерисовки она
	mov ebx, 2   ;, но на этот раз - о конце перерисовки
	int 0x40

	ret

increase_y:
	; Увеличим вертикальную координату вывода букв,
	; если кончилась строка (встретился байт 0x00)
	and edx,0x0000FFFF
	add edx, 33

	ret

;ПРОЦЕДУРА ПЕРЕРИСОВКИ ДВУХ СИМВОЛОВ (ДАБЫ МИНИМИЗИРОВАТЬ МИГАНИЕ)
redraw_2_symbols:

	;Проверим, не выйдем ли мы при рисованаии за границу допустимой
	;области внутри окна. Если выйдем - скроллим строку по горизонтали
	mov esi, [windowwidth] ;Теперь в esi размер окна

	mov eax, [currentsymb]
	sub eax, [startline]

	mov ecx, 18

	mul ecx

	add eax, 20

	add eax, 20

	add eax, 40

	cmp eax, esi
	jna r2s_horizontal_check_ok	;Если eax>est, то мы выходим за пределы окна.

	;Итак, мы выходим за границы окна... Это плохо...
	;Строку придётся скроллить...

	mov eax, [currentsymb]
	dec eax
	mov [startline], eax
	call draw_window
	jmp return_from_redraw_2_symbols

r2s_horizontal_check_ok:

	;Рисуем ПРЕДЫДУЩУЮ СЕРУЮ букву с помощью БОЛЬШОГО шрифта

	mov ebx, [currentsymb]
	dec ebx

	movzx eax, byte [ebx]
	mov ecx, 64

	mul ecx

	add eax, big_font

	mov ebx, eax


	mov ecx, 16*65536+32

	mov eax, [currentsymb]
	sub eax, [startline]
	dec eax
	mov esi, 18
	mul esi
	add eax, 18
	mov esi, 65536
	mul esi
	add eax, 40

	mov edx, eax


	mov esi, 1

	mov edi, gray_text

	mov ebp, 0

	mov eax, 65

	int 0x40


	;Рисуем ТЕКУЩУЮ БУКВУ


	mov ebx, [currentsymb]

	movzx eax, byte [ebx]
	mov ecx, 64
	mul ecx
	add eax, big_font

	mov ebx, eax

	mov ecx, 16*65536+32

	mov eax, [currentsymb]
	sub eax, [startline]
	mov esi, 18
	mul esi
	add eax, 18
	mov esi, 65536
	mul esi
	add eax, 40

	mov edx, eax

	mov esi, 1

	mov edi, red_text

	mov eax, 65

	int 0x40


return_from_redraw_2_symbols:

	ret

redraw_mistakes:
	;Закрасим прямоугольник
	mov eax, 13
	mov ebx, 59*65536+75
	mov ecx, 14*65536+10
	mov edx, 0x00CCCCCC
	int 0x40

	; Нарисуем надпись "ОШИБОК"
	mov eax, 4
	mov ebx, 60*65536+15
	mov ecx, 0x80AA0000
	mov edx, mistakestext
	int 0x40

	; Выведем число ошибок
	mov eax, 47
	mov ebx, 10000000000001000000000000000000b
	mov ecx, [mistakes]
	mov edx, 105*65536+15
	mov esi, 0x00AA0000
	int 0x40

	ret

count_lines:
	xor ecx, ecx		; В ecx - счётчик строк
	inc ecx 		; У нас 1 строка


	; Начинаем разбор...
	mov eax, [startline]
	dec eax

cl_next_step:
	inc eax
	mov bh, [eax]

	cmp bh, 0x00
	jne cl_not_new_line
	inc ecx
	jmp cl_next_step

cl_not_new_line:
	cmp bh, 0xFE
	je cl_end
	cmp bh, 0xFF
	je cl_end
	jmp cl_next_step

cl_end:
	mov [linecount], ecx
	ret

reset_speed_counters:
	mov eax, 0x00000000

	mov [symbtyped], eax
	mov [typestarttime], eax
	mov [currenttime], eax
	mov [typingspeed], eax

	ret

count_speed:
	mov eax, 26
	mov ebx, 9
	int 0x40

	mov [currenttime], eax

	mov ebx, [typestarttime]

	sub eax, ebx   ;Теперь в eax - число прошедших долей секунд


	mov ecx, [symbtyped]
	cmp ecx, 0x00
	jne cs_all_ok
	inc ecx

cs_all_ok:
	xor edx, edx;

	div ecx  ;Теперь в eax - средняя пауза между символами

	mov ecx, eax
	cmp ecx, 0x00
	jne cs_all_ok_2
	inc ecx

cs_all_ok_2:

	xor edx, edx
	mov eax, 6000

	div ecx

	mov [typingspeed], eax ;Вот и всё. В [typingspeed] - средняя скорость набора


	ret

speed_to_string:
	; Преобразует число в строку и записывает по адрему переменной speedbytes задом наперёд
	xor edx, edx
	mov eax, [typingspeed]

	mov ecx, 10

	div ecx

	add dl, 30h
	mov [speedbytes + 3], dl

	xor edx, edx
	div ecx
	add dl, 30h
	mov [speedbytes + 2], dl

	xor edx, edx
	div ecx
	add dl, 30h
	mov [speedbytes + 1], dl

	xor edx, edx
	div ecx

	cmp dl, 0x00
	je sts_move_space

	add dl, 30h
	mov [speedbytes], dl
	jmp sts_end
    sts_move_space:
	mov [speedbytes], 0x20

    sts_end:

	ret

get_screen_params:

	mov eax, 14
	int 0x40
	mov [areaheight], ax

	push ax

	shr eax, 16
	mov [areawidth],ax

	;В ax по прежнему находится ширина окна. Воспользуемся этим
	sub ax, 780   ;Вычтем начальный размер окна
	shr ax, 1

	mov [windowx], ax


	; Переходим к высоте
	xor ax, ax
	pop ax		; Вытолкнем из стека значение высоты

	sub ax, 580
	shr ax, 1
	mov [windowy], ax


	ret




;draw_speed:

	;Закрасим прямоугольник
;        mov eax, 13
;        mov ebx, 59*65536+340
;        mov ecx, 29*65536+10
;        mov edx, 0x00CCCCCC
;        int 0x40

	; Нарисуем надпись "Скорость набора (знаков в минуту):"
;        mov eax, 4
;        mov ebx, 60*65536+30
;        mov ecx, 0x80008800
;        mov edx, speedtext
;        int 0x40

	; Выведем число
;        mov eax, 47
;        mov ebx, 10000000000001000000000000000000b
;        mov ecx, [typingspeed]
;        mov edx, 305*65536+30
;        mov esi, 0x00008800
;        int 0x40

;        ret

;Ресурсы )
datastart dd 0x0       ; Адрес в памяти, по которому находятся данные для набора
currentsymb dd 0x0     ; Текущий символ
startline dd 0x0       ; Начало первой видимой строки
lessonstart dd 0x0
lastsymb dd 0x0        ; Символ в памяти, набранный последним
mistakes dd 0x0        ; Количество ошибок

areawidth dw 0x0
areaheight dw 0x0
windowx dw 0x0
windowy dw 0x0

linecount dd 0x00
currentline dd 0x00

symbtyped dd 0x0
typestarttime dd 0x0
currenttime dd 0x0
typingspeed dd 0x0

windowwidth dd 0x00
windowheight dd 0x00

text db 'Клавиатурный тренажёр -КJ|AВu|||A- 0.9',0
buttontext db 'Следующее упражнение', 0
retrybuttontext db 'Повторить упражнение', 0
restartbuttontext db 'Начать курс заново', 0

speedtext db 'Скорость набора (знаков в минуту):',0
mistakestext db 'ОШИБОК:', 0
lessoncomplete db 'Упражнение завершено!',0x00
db 'Средняя скорость набора: '
speedbytes db 0x30,0x30,0x30,0x30
db ' зн./мин.', 0xFE, 0xFF
lessoncompleteend:

lineistext db 'СТРОКА        ИЗ', 0

kbbuffer db 1024 DUP (0x00)
filestruct:	 ;Структура данных для вызова функции 70
arg1 dd 0x0
arg2 dd 0x0
arg3 dd 0x0
arg4 dd 0x0
arg5 dd 0x0
arg6 db 0x0
arg7 dd 0x0

filedatastruct:   ;Атрибуты и данные файла
attrib dd 0x0
fntype db 0x0
db 0x0
db 0x0
db 0x0
dd 0x0	;+8
dd 0x0	;+12
dd 0x0	;+16
dd 0x0	;+20
dd 0x0	;+24
dd 0x0	;+28
size  dq 0x0  ;+32
;size2 dd 0x0  ;+36

filesize dd 0x0

par:
params rb 1024

string db 0x07,' КЛАВИАТУРНЫЙ  ____________    для ОС ',0x07, 0x00
       db 0x07,' ТРЕНАЖЕР     I KJ|ABuIIIA I          ', 0x07, 0x00
       db 0x07,' ВЕРСИЯ 0.9   I____________I  КОЛИБРИ ', 0x07, 0x00
       db 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07
       db 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07
       db 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07
       db 0x07, 0x07, 0x07, 0x07, 0x07, 0x07, 0x07,  0x00

       db 0x07, 0x07, 0x07, '  написано на чистом ассемблере   ',0x07, 0x07, 0x07, 0x0
       db  ' ',0x0
       db  'Разработчики:', 0x00
       db  '- Андрей Михайлович [Dron2004] ', 0x00
       db  ' ',0x0

       db  '   Программа была запущена без  пара-', 0x00
       db  'метров. Для полноценной работы с про-', 0x00
       db  'граммой необходим файл в формате .KLA,', 0x00
       db  'содержащий учебные задания для набора.', 0x00
       db  ' ', 0x00
       db  '(щелкните на кнопке СЛЕДУЮЩЕЕ УПРАЖНЕНИЕ)', 0xFE

       db  0x07,'  KLA-файл содержит строки для набора,', 0x00
       db  'разделённые   нулевым  символом (0x00).', 0x00
       db  'Уроки отделяются один от другого байтом', 0x00
       db  '0xFE  (ставится   в   конце   последней', 0x00
       db  'строки урока вместо 0x00).  Файл должен', 0x00
       db  'заканчиваться  байтом   0xFF  (ставится', 0x00
       db  'в  конце  последней  строки  последнего', 0x00
       db  'урока после 0xFE).', 0x00
       db  '   Имя  KLA-файла  передается программе', 0x00
       db  'при  запуске   в   качестве   параметра', 0x00
       db  'командной   строки, например:', 0x00
       db  ' ', 0x00
       db  'klavisha /rd/1/lessons.kla', 0x00
       db  ' ', 0x00
       db  '(щелкните на кнопке СЛЕДУЮЩЕЕ УПРАЖНЕНИЕ)', 0xFE
       db  0x07,'  Ваша  задача  -  набрать  предложенный', 0x00
       db  'текст с минимальным  количеством  ошибок.', 0x00
       db  'Переход  с одного  упражнения   на другое', 0x00
       db  'осуществляется     с    помощью    кнопки', 0x00
       db  'СЛЕДУЮЩЕЕ УПРАЖНЕНИЕ.', 0x00
       db  'А   теперь  можете попробовать поработать', 0x00
       db  'с  набором.  Щелкните на кнопке СЛЕДУЮЩЕЕ', 0x00
       db  'УПРАЖНЕНИЕ и начинайте набирать текст!,', 0x00
       db  '   Но помните:  это  только демонстрация!', 0x00
       db  'Для  обучения быстрому набору необходим', 0x00
       db  'соответствующий KLA-файл!', 0x00
       db  ' ', 0x00
       db  ' ', 0x00
       db  '(щелкните на кнопке СЛЕДУЮЩЕЕ УПРАЖНЕНИЕ)', 0xFE
       db  'фыва пр олдж фыва пр олдж фыва пр олдж', 0x00
       db  'фыва пр олдж фыва пр олдж фыва пр олдж', 0x00
       db  'фыва пр олдж фыва пр олдж фыва пр олдж', 0x00
       db  'э ж э ж э ж э ж э ж э ж э ж э ж э ж э', 0x00
       db  'э ж э ж э ж э ж э ж э ж э ж э ж э ж э', 0x00
       db  'фыва вава пара ора лорд вода эээ ров', 0x00
       db  'фыва вава пара ора лорд вода эээ ров', 0x00
       db  'фыва вава пара ора лорд вода эээ ров', 0x00
       db  'вал лов вова пора пар жд элло дол род', 0x00
       db  'вал лов вова пора пар жд элло дол род', 0x00
       db  'вал лов вова пора пар жд элло дол род', 0x00
       db  'выл ор жара дар жэ эж фы ыф ва ло да',0x00
       db  'выл ор жара дар жэ эж фы ыф ва ло да',0x00
       db  'выл ор жара дар жэ эж фы ыф ва ло да',0xFE
       db  'ячсми тьбю ячсми тьбю ячсми тьбю яч бю', 0x00
       db  'ячсми тьбю ячсми тьбю ячсми тьбю яч бю', 0x00
       db  'форма жора жара митя бюро тюрьма яма', 0x00
       db  'мама мама мама мама мама мама мама',0x00
       db  'папа папа папа папа папа папа папа',0x00
       db  'сила сом мост томь ром мир правда чары', 0x00
       db  'миф вар дом строить стоит ломать дичь', 0x00
       db  'солома март тяжба явь ломать строить', 0xFE
       db  'йцуке нгшщзхъ йцуке нгшщзхъ', 0x00
       db  'йцуке нгшщзхъ йцуке нгшщзхъ', 0x00
       db  'город кемерово стоит на реке томь', 0x00
       db  'но называется не томск потому что', 0x00
       db  'томск это другой город сибири', 0x00
       db  'наконец можно использовать клавиши', 0x00
       db  'всех рядов клавиатуры', 0xFE
       db  'колибри - это компактная много-', 0x00
       db  'задачная операционная система,', 0x00
       db  'написанная на чистом ассемблере.', 0x00
       db  'система необычайно быстра и компактна.', 0x00
       db  'слава колибри! ура!', 0x00
       db  'тренировка набора подошла к концу', 0xFE, 0xFF

stringend:

big_font:
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 252, 63, 252, 192, 3, 192, 3
db 204, 51, 204, 51, 192, 3, 192, 3, 192, 3
db 192, 3, 207, 243, 207, 243, 195, 195, 195, 195
db 192, 3, 192, 3, 192, 3, 192, 3, 63, 252
db 63, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 252, 63, 252
db 255, 255, 255, 255, 243, 207, 243, 207, 255, 255
db 255, 255, 255, 255, 255, 255, 240, 15, 240, 15
db 252, 63, 252, 63, 255, 255, 255, 255, 255, 255
db 255, 255, 63, 252, 63, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 60, 240
db 60, 240, 255, 252, 255, 252, 255, 252, 255, 252
db 255, 252, 255, 252, 255, 252, 255, 252, 63, 240
db 63, 240, 15, 192, 15, 192, 3, 0, 3, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 0, 3, 0, 15, 192, 15, 192
db 63, 240, 63, 240, 255, 252, 255, 252, 63, 240
db 63, 240, 15, 192, 15, 192, 3, 0, 3, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 15, 240, 15, 240
db 15, 240, 15, 240, 252, 63, 252, 63, 252, 63
db 252, 63, 252, 63, 252, 63, 3, 192, 3, 192
db 3, 192, 3, 192, 15, 240, 15, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 192, 3, 192
db 15, 240, 15, 240, 63, 252, 63, 252, 255, 255
db 255, 255, 255, 255, 255, 255, 63, 252, 63, 252
db 3, 192, 3, 192, 3, 192, 3, 192, 15, 240
db 15, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 15, 240, 15, 240
db 15, 240, 15, 240, 3, 192, 3, 192, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 252, 63, 252, 63
db 240, 15, 240, 15, 240, 15, 240, 15, 252, 63
db 252, 63, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 15, 240, 15, 240
db 60, 60, 60, 60, 48, 12, 48, 12, 48, 12
db 48, 12, 60, 60, 60, 60, 15, 240, 15, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 240, 15, 240, 15, 195, 195, 195, 195, 207, 243
db 207, 243, 207, 243, 207, 243, 195, 195, 195, 195
db 240, 15, 240, 15, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 252, 3, 252, 0, 252, 0, 252
db 3, 204, 3, 204, 15, 12, 15, 12, 63, 192
db 63, 192, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 63, 192
db 63, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 15, 240, 15, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 15, 240, 15, 240
db 3, 192, 3, 192, 63, 252, 63, 252, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 255, 15, 255, 15, 15, 15, 15, 15, 255
db 15, 255, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 63, 0
db 63, 0, 255, 0, 255, 0, 252, 0, 252, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 255, 63, 255, 60, 15
db 60, 15, 63, 255, 63, 255, 60, 15, 60, 15
db 60, 15, 60, 15, 60, 15, 60, 15, 60, 15
db 60, 15, 60, 63, 60, 63, 252, 63, 252, 63
db 252, 60, 252, 60, 240, 0, 240, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 243, 207, 243, 207, 15, 240, 15, 240, 252, 63
db 252, 63, 15, 240, 15, 240, 243, 207, 243, 207
db 3, 192, 3, 192, 3, 192, 3, 192, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 192, 0
db 192, 0, 240, 0, 240, 0, 252, 0, 252, 0
db 255, 0, 255, 0, 255, 192, 255, 192, 255, 252
db 255, 252, 255, 192, 255, 192, 255, 0, 255, 0
db 252, 0, 252, 0, 240, 0, 240, 0, 192, 0
db 192, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 12, 0, 12, 0, 60, 0, 60
db 0, 252, 0, 252, 3, 252, 3, 252, 15, 252
db 15, 252, 255, 252, 255, 252, 15, 252, 15, 252
db 3, 252, 3, 252, 0, 252, 0, 252, 0, 60
db 0, 60, 0, 12, 0, 12, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 192, 3, 192, 15, 240, 15, 240, 63, 252
db 63, 252, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 63, 252, 63, 252, 15, 240
db 15, 240, 3, 192, 3, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 0, 0, 0, 0, 60, 60, 60, 60
db 60, 60, 60, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 255
db 63, 255, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 63, 207, 63, 207, 3, 207
db 3, 207, 3, 207, 3, 207, 3, 207, 3, 207
db 3, 207, 3, 207, 3, 207, 3, 207, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 60, 0, 60, 0
db 15, 192, 15, 192, 60, 240, 60, 240, 240, 60
db 240, 60, 240, 60, 240, 60, 60, 240, 60, 240
db 15, 192, 15, 192, 0, 240, 0, 240, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 255, 252, 255, 252, 255, 252
db 255, 252, 255, 252, 255, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 192, 3, 192, 15, 240, 15, 240, 63, 252
db 63, 252, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 63, 252, 63, 252, 15, 240
db 15, 240, 3, 192, 3, 192, 63, 252, 63, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 15, 240
db 15, 240, 63, 252, 63, 252, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 63, 252, 63, 252
db 15, 240, 15, 240, 3, 192, 3, 192, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 0, 240
db 0, 240, 255, 252, 255, 252, 0, 240, 0, 240
db 3, 192, 3, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 15, 0
db 15, 0, 60, 0, 60, 0, 255, 252, 255, 252
db 60, 0, 60, 0, 15, 0, 15, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 0, 240, 0, 255, 252
db 255, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 12, 192, 12, 192
db 60, 240, 60, 240, 255, 252, 255, 252, 60, 240
db 60, 240, 12, 192, 12, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 0, 3, 0
db 15, 192, 15, 192, 15, 192, 15, 192, 63, 240
db 63, 240, 63, 240, 63, 240, 255, 252, 255, 252
db 255, 252, 255, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 255, 252, 255, 252, 63, 240
db 63, 240, 63, 240, 63, 240, 15, 192, 15, 192
db 15, 192, 15, 192, 3, 0, 3, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 192, 3, 192, 15, 240, 15, 240, 15, 240
db 15, 240, 15, 240, 15, 240, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 12, 48, 12, 48, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 60, 240, 60, 240, 60, 240, 60, 240
db 255, 252, 255, 252, 60, 240, 60, 240, 60, 240
db 60, 240, 60, 240, 60, 240, 255, 252, 255, 252
db 60, 240, 60, 240, 60, 240, 60, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 3, 192
db 3, 192, 63, 240, 63, 240, 240, 60, 240, 60
db 240, 12, 240, 12, 240, 0, 240, 0, 63, 240
db 63, 240, 0, 60, 0, 60, 0, 60, 0, 60
db 192, 60, 192, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 3, 192, 3, 192, 3, 192, 3, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 240, 12, 240, 12, 240, 60
db 240, 60, 0, 240, 0, 240, 3, 192, 3, 192
db 15, 0, 15, 0, 60, 0, 60, 0, 240, 60
db 240, 60, 192, 60, 192, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 192, 15, 192, 60, 240, 60, 240, 60, 240
db 60, 240, 15, 192, 15, 192, 63, 60, 63, 60
db 243, 240, 243, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 63, 60, 63, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 60, 0, 60, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 240
db 0, 240, 3, 192, 3, 192, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 3, 192, 3, 192, 0, 240, 0, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 15, 0, 15, 0, 3, 192, 3, 192
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 3, 192, 3, 192, 15, 0
db 15, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 60, 60
db 60, 60, 15, 240, 15, 240, 255, 255, 255, 255
db 15, 240, 15, 240, 60, 60, 60, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 63, 252, 63, 252, 3, 192, 3, 192, 3, 192
db 3, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 15, 0, 15, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 3, 192
db 3, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 12, 0, 12, 0, 60
db 0, 60, 0, 240, 0, 240, 3, 192, 3, 192
db 15, 0, 15, 0, 60, 0, 60, 0, 240, 0
db 240, 0, 192, 0, 192, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 252, 240, 252, 243, 60, 243, 60
db 252, 60, 252, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 63, 240, 63, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 15, 192
db 15, 192, 63, 192, 63, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 63, 252, 63, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 0, 60, 0, 60
db 0, 240, 0, 240, 3, 192, 3, 192, 15, 0
db 15, 0, 60, 0, 60, 0, 240, 0, 240, 0
db 240, 60, 240, 60, 255, 252, 255, 252, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 240, 63, 240, 240, 60, 240, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 15, 240
db 15, 240, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 60, 0, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 240, 0, 240
db 3, 240, 3, 240, 15, 240, 15, 240, 60, 240
db 60, 240, 240, 240, 240, 240, 255, 252, 255, 252
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 3, 252, 3, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 240, 0, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 0, 255, 240, 255, 240
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 60, 240, 60, 240, 60, 63, 240, 63, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 192, 15, 192, 60, 0
db 60, 0, 240, 0, 240, 0, 240, 0, 240, 0
db 255, 240, 255, 240, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 63, 240, 63, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 240, 60, 240, 60, 0, 60, 0, 60
db 0, 60, 0, 60, 0, 240, 0, 240, 3, 192
db 3, 192, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 240, 63, 240, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 63, 252, 63, 252, 0, 60, 0, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 240
db 0, 240, 63, 192, 63, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 15, 0, 15, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 60, 0, 60, 0, 240, 0, 240
db 3, 192, 3, 192, 15, 0, 15, 0, 60, 0
db 60, 0, 15, 0, 15, 0, 3, 192, 3, 192
db 0, 240, 0, 240, 0, 60, 0, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 252, 63, 252, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 252, 63, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 60, 0, 60, 0, 15, 0, 15, 0, 3, 192
db 3, 192, 0, 240, 0, 240, 0, 60, 0, 60
db 0, 240, 0, 240, 3, 192, 3, 192, 15, 0
db 15, 0, 60, 0, 60, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 240, 60
db 240, 60, 0, 240, 0, 240, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 243, 252, 243, 252, 243, 252, 243, 252, 243, 252
db 243, 252, 243, 240, 243, 240, 240, 0, 240, 0
db 63, 240, 63, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 0
db 3, 0, 15, 192, 15, 192, 60, 240, 60, 240
db 240, 60, 240, 60, 240, 60, 240, 60, 255, 252
db 255, 252, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 240, 255, 240, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 63, 240
db 63, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 255, 240
db 255, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 15, 240, 15, 240
db 60, 60, 60, 60, 240, 12, 240, 12, 240, 0
db 240, 0, 240, 0, 240, 0, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 12, 240, 12, 60, 60
db 60, 60, 15, 240, 15, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 192, 255, 192, 60, 240, 60, 240, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 240, 60, 240, 255, 192, 255, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 252, 255, 252, 60, 60
db 60, 60, 60, 12, 60, 12, 60, 192, 60, 192
db 63, 192, 63, 192, 60, 192, 60, 192, 60, 0
db 60, 0, 60, 12, 60, 12, 60, 60, 60, 60
db 255, 252, 255, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 60, 60, 60, 60, 60, 12, 60, 12
db 60, 192, 60, 192, 63, 192, 63, 192, 60, 192
db 60, 192, 60, 0, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 255, 0, 255, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 15, 240, 15, 240, 60, 60, 60, 60
db 240, 12, 240, 12, 240, 0, 240, 0, 240, 0
db 240, 0, 243, 252, 243, 252, 240, 60, 240, 60
db 240, 60, 240, 60, 60, 60, 60, 60, 15, 204
db 15, 204, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 255, 252, 255, 252, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 240, 15, 240, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 15, 240, 15, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 252, 3, 252, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 63, 192, 63, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 252, 60
db 252, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 240, 60, 240, 63, 192, 63, 192, 63, 192
db 63, 192, 60, 240, 60, 240, 60, 60, 60, 60
db 60, 60, 60, 60, 252, 60, 252, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 0, 255, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 60, 12, 60, 12, 60, 60, 60, 60, 255, 252
db 255, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 252, 252, 252, 252, 255, 252, 255, 252, 255, 252
db 255, 252, 243, 60, 243, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 60, 240, 60, 252, 60, 252, 60, 255, 60
db 255, 60, 255, 252, 255, 252, 243, 252, 243, 252
db 240, 252, 240, 252, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 240, 63, 240, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 63, 240, 63, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 240
db 255, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 63, 240, 63, 240, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 255, 0, 255, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 240, 63, 240, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 243, 60, 243, 60, 243, 252, 243, 252, 63, 240
db 63, 240, 0, 240, 0, 240, 0, 252, 0, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 255, 240, 255, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 63, 240, 63, 240, 60, 240, 60, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 252, 60, 252, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 240, 60
db 240, 60, 60, 0, 60, 0, 15, 192, 15, 192
db 0, 240, 0, 240, 0, 60, 0, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 63, 240, 63, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 252, 63, 252, 63, 252
db 63, 252, 51, 204, 51, 204, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 15, 240, 15, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 60, 240, 60, 240, 15, 192, 15, 192, 3, 0
db 3, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 255, 252, 255, 252, 252, 252
db 252, 252, 60, 240, 60, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 60, 240, 60, 240, 60, 240, 60, 60, 240
db 60, 240, 63, 240, 63, 240, 15, 192, 15, 192
db 15, 192, 15, 192, 63, 240, 63, 240, 60, 240
db 60, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 15, 240, 15, 240, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 15, 240, 15, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 240, 60, 240, 60, 192, 60, 192, 60
db 0, 240, 0, 240, 3, 192, 3, 192, 15, 0
db 15, 0, 60, 0, 60, 0, 240, 12, 240, 12
db 240, 60, 240, 60, 255, 252, 255, 252, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 15, 240, 15, 240, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 240
db 15, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 192, 0, 192, 0, 240, 0, 240, 0, 252, 0
db 252, 0, 63, 0, 63, 0, 15, 192, 15, 192
db 3, 240, 3, 240, 0, 252, 0, 252, 0, 60
db 0, 60, 0, 12, 0, 12, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 240, 15, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 15, 240, 15, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 0, 3, 0
db 15, 192, 15, 192, 60, 240, 60, 240, 240, 60
db 240, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 255, 255, 255, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 15, 0
db 15, 0, 3, 192, 3, 192, 0, 240, 0, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 192
db 63, 192, 0, 240, 0, 240, 63, 240, 63, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 63, 60, 63, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 252, 0, 252, 0, 60, 0, 60, 0, 60, 0
db 60, 0, 63, 192, 63, 192, 60, 240, 60, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 63, 240, 63, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 240, 0, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 0, 240, 60, 240, 60
db 63, 240, 63, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 240
db 3, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 15, 240, 15, 240, 60, 240, 60, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 63, 60, 63, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 240, 63, 240, 240, 60
db 240, 60, 255, 252, 255, 252, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 240, 3, 240
db 15, 60, 15, 60, 15, 12, 15, 12, 15, 0
db 15, 0, 63, 192, 63, 192, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 63, 192, 63, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 60, 63, 60, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 63, 240, 63, 240
db 0, 240, 0, 240, 240, 240, 240, 240, 63, 192
db 63, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 252, 0, 252, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 240, 60, 240
db 63, 60, 63, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 252, 60, 252, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 0, 0, 0
db 15, 192, 15, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 15, 240, 15, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 0, 0, 0, 0, 252, 0, 252, 0, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 15, 240, 15, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 252, 0, 252, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 60
db 60, 60, 60, 240, 60, 240, 63, 192, 63, 192
db 63, 192, 63, 192, 60, 240, 60, 240, 60, 60
db 60, 60, 252, 60, 252, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 15, 192, 15, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 15, 240, 15, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 252, 240, 252, 240
db 255, 252, 255, 252, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 240, 60, 240, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 243, 240, 243, 240, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 240, 63, 240, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 243, 240
db 243, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 63, 240, 63, 240, 60, 0, 60, 0
db 60, 0, 60, 0, 255, 0, 255, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 60, 63, 60, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 63, 240, 63, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 3, 252
db 3, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 243, 240, 243, 240
db 63, 60, 63, 60, 60, 60, 60, 60, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 255, 0, 255, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 60, 0
db 60, 0, 15, 192, 15, 192, 0, 240, 0, 240
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 0, 3, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 255, 240, 255, 240, 15, 0
db 15, 0, 15, 0, 15, 0, 15, 0, 15, 0
db 15, 0, 15, 0, 15, 60, 15, 60, 3, 240
db 3, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 63, 60, 63, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 60, 240, 60, 240, 15, 192, 15, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 240, 60, 240, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 255, 252, 255, 252
db 60, 240, 60, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 60, 240, 60, 60, 240, 60, 240, 15, 192
db 15, 192, 15, 192, 15, 192, 15, 192, 15, 192
db 60, 240, 60, 240, 240, 60, 240, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 252
db 63, 252, 0, 60, 0, 60, 0, 240, 0, 240
db 255, 192, 255, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 240, 240, 240, 240, 3, 192, 3, 192
db 15, 0, 15, 0, 60, 0, 60, 0, 240, 60
db 240, 60, 255, 252, 255, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 252, 0, 252, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 63, 0, 63, 0
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 252, 0, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 0
db 63, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 0, 252, 0, 252, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 63, 0, 63, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 60
db 63, 60, 243, 240, 243, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 0, 3, 0, 15, 192
db 15, 192, 60, 240, 60, 240, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 255, 252
db 255, 252, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 252, 3, 252, 15, 60, 15, 60, 60, 60
db 60, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 255, 252, 255, 252, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 252, 255, 252, 60, 12
db 60, 12, 60, 0, 60, 0, 60, 0, 60, 0
db 63, 240, 63, 240, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 255, 240, 255, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 240
db 255, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 63, 240, 63, 240, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 255, 240, 255, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 252, 255, 252, 60, 60, 60, 60
db 60, 12, 60, 12, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 255, 0
db 255, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 252, 3, 252
db 15, 60, 15, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 255, 255, 255, 255, 240, 15, 240, 15
db 192, 3, 192, 3, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 60, 60, 60, 60, 60, 12
db 60, 12, 60, 192, 60, 192, 63, 192, 63, 192
db 60, 192, 60, 192, 60, 0, 60, 0, 60, 12
db 60, 12, 60, 60, 60, 60, 255, 252, 255, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 243, 207, 243, 207, 243, 207
db 243, 207, 51, 204, 51, 204, 51, 204, 51, 204
db 63, 252, 63, 252, 63, 252, 63, 252, 51, 204
db 51, 204, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 0, 60, 0, 60
db 0, 60, 0, 60, 15, 240, 15, 240, 0, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 60
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 252, 240, 252, 243, 252
db 243, 252, 255, 60, 255, 60, 252, 60, 252, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 60, 240
db 60, 240, 15, 192, 15, 192, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 252
db 240, 252, 243, 252, 243, 252, 255, 60, 255, 60
db 252, 60, 252, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 252, 60, 252, 60, 60, 60, 60, 60, 60, 240
db 60, 240, 60, 240, 60, 240, 63, 192, 63, 192
db 63, 192, 63, 192, 60, 240, 60, 240, 60, 240
db 60, 240, 60, 60, 60, 60, 252, 60, 252, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 255, 3, 255, 15, 60
db 15, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 240, 255, 240, 255, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 60
db 240, 60, 252, 252, 252, 252, 255, 252, 255, 252
db 255, 252, 255, 252, 243, 60, 243, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 255, 252
db 255, 252, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 240, 255, 240, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 63, 240, 63, 240, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 60, 0
db 255, 0, 255, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 0, 240, 0, 240, 0, 240, 0, 240, 0
db 240, 0, 240, 0, 240, 0, 240, 12, 240, 12
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 255, 255, 255, 243, 207, 243, 207
db 195, 195, 195, 195, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 15, 240
db 15, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 63, 252, 63, 252
db 0, 60, 0, 60, 0, 60, 0, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 252, 63, 252, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 243, 207, 63, 252
db 63, 252, 3, 192, 3, 192, 15, 240, 15, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 240, 60, 240, 60, 240, 60
db 240, 60, 60, 240, 60, 240, 63, 240, 63, 240
db 15, 192, 15, 192, 15, 192, 15, 192, 63, 240
db 63, 240, 60, 240, 60, 240, 240, 60, 240, 60
db 240, 60, 240, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 255, 255, 255, 255, 0, 15
db 0, 15, 0, 15, 0, 15, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 63, 252, 63, 252, 0, 60, 0, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 0, 60
db 0, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 255, 252, 255, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 255, 255, 255, 255
db 0, 15, 0, 15, 0, 15, 0, 15, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 192, 255, 192, 255, 0
db 255, 0, 207, 0, 207, 0, 15, 0, 15, 0
db 15, 252, 15, 252, 15, 15, 15, 15, 15, 15
db 15, 15, 15, 15, 15, 15, 15, 15, 15, 15
db 63, 252, 63, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 15
db 240, 15, 240, 15, 240, 15, 240, 15, 240, 15
db 240, 15, 240, 15, 255, 15, 255, 15, 243, 207
db 243, 207, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 255, 15, 255, 15, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 0, 255, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 60, 0, 63, 240
db 63, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 255, 240
db 255, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 0, 60, 0, 60, 12, 60
db 12, 60, 15, 252, 15, 252, 12, 60, 12, 60
db 0, 60, 0, 60, 0, 60, 0, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 252, 240, 252, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 255, 207, 255, 207
db 243, 207, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 240, 252, 240, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 255, 15, 255, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 15, 252, 15, 252, 15, 252, 15, 252, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 252, 63, 252, 63, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 192, 63, 192, 0, 240, 0, 240, 63, 240
db 63, 240, 240, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 63, 60, 63, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 12
db 0, 12, 0, 60, 0, 60, 63, 240, 63, 240
db 240, 0, 240, 0, 240, 0, 240, 0, 255, 240
db 255, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 240
db 255, 240, 60, 60, 60, 60, 60, 60, 60, 60
db 63, 240, 63, 240, 60, 60, 60, 60, 60, 60
db 60, 60, 255, 240, 255, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 252, 255, 252, 60, 12, 60, 12
db 60, 12, 60, 12, 60, 0, 60, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 255, 0, 255, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 3, 252, 3, 252
db 15, 60, 15, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 255, 255, 255, 255, 240, 15, 240, 15, 240, 15
db 240, 15, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 240, 60
db 240, 60, 255, 252, 255, 252, 240, 0, 240, 0
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 243, 60, 243, 60, 243, 60
db 243, 60, 51, 48, 51, 48, 63, 240, 63, 240
db 51, 48, 51, 48, 243, 60, 243, 60, 243, 60
db 243, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 0, 60, 0, 60
db 15, 240, 15, 240, 0, 60, 0, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 252, 240, 252, 243, 60, 243, 60, 252, 60
db 252, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 60, 240
db 60, 240, 15, 192, 15, 192, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 252, 240, 252, 243, 60
db 243, 60, 252, 60, 252, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 252, 60, 252, 60, 60, 240, 60, 240, 63, 192
db 63, 192, 63, 192, 63, 192, 60, 240, 60, 240
db 60, 60, 60, 60, 252, 60, 252, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 252, 3, 252, 15, 60
db 15, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 252, 60
db 252, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 60
db 240, 60, 252, 252, 252, 252, 255, 252, 255, 252
db 255, 252, 255, 252, 243, 60, 243, 60, 243, 60
db 243, 60, 240, 60, 240, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 255, 252, 255, 252, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 63, 240, 63, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 3, 3, 3, 48, 48
db 48, 48, 3, 3, 3, 3, 48, 48, 48, 48
db 3, 3, 3, 3, 48, 48, 48, 48, 3, 3
db 3, 3, 48, 48, 48, 48, 3, 3, 3, 3
db 48, 48, 48, 48, 3, 3, 3, 3, 48, 48
db 48, 48, 3, 3, 3, 3, 48, 48, 48, 48
db 3, 3, 3, 3, 48, 48, 48, 48, 51, 51
db 51, 51, 204, 204, 204, 204, 51, 51, 51, 51
db 204, 204, 204, 204, 51, 51, 51, 51, 204, 204
db 204, 204, 51, 51, 51, 51, 204, 204, 204, 204
db 51, 51, 51, 51, 204, 204, 204, 204, 51, 51
db 51, 51, 204, 204, 204, 204, 51, 51, 51, 51
db 204, 204, 204, 204, 51, 51, 51, 51, 204, 204
db 204, 204, 243, 243, 243, 243, 63, 63, 63, 63
db 243, 243, 243, 243, 63, 63, 63, 63, 243, 243
db 243, 243, 63, 63, 63, 63, 243, 243, 243, 243
db 63, 63, 63, 63, 243, 243, 243, 243, 63, 63
db 63, 63, 243, 243, 243, 243, 63, 63, 63, 63
db 243, 243, 243, 243, 63, 63, 63, 63, 243, 243
db 243, 243, 63, 63, 63, 63, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 255, 192
db 255, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 255, 192, 255, 192, 3, 192
db 3, 192, 255, 192, 255, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 255, 60, 255, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 252, 255, 252, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 255, 192, 255, 192
db 3, 192, 3, 192, 255, 192, 255, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 255, 60, 255, 60, 0, 60, 0, 60, 255, 60
db 255, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 252
db 255, 252, 0, 60, 0, 60, 255, 60, 255, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 255, 60, 255, 60, 0, 60, 0, 60
db 255, 252, 255, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 255, 252, 255, 252, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 255, 192, 255, 192, 3, 192, 3, 192, 255, 192
db 255, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 192, 255, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 255, 3, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 255, 255, 255, 255, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 255, 255, 255, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 255
db 3, 255, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 255, 255, 255, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 255, 255, 255, 255
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 255, 3, 255, 3, 192, 3, 192
db 3, 255, 3, 255, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 63, 15, 63, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 63, 15, 63, 15, 0, 15, 0, 15, 255
db 15, 255, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 255, 15, 255, 15, 0
db 15, 0, 15, 63, 15, 63, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 255, 63
db 255, 63, 0, 0, 0, 0, 255, 255, 255, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 255, 255, 255, 255, 0, 0, 0, 0
db 255, 63, 255, 63, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 63, 15, 63
db 15, 0, 15, 0, 15, 63, 15, 63, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 255, 255, 255, 255, 0, 0, 0, 0, 255, 255
db 255, 255, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 255, 63, 255, 63, 0, 0
db 0, 0, 255, 63, 255, 63, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 255, 255
db 255, 255, 0, 0, 0, 0, 255, 255, 255, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 255, 255, 255, 255, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 255, 255, 255, 255
db 0, 0, 0, 0, 255, 255, 255, 255, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 255
db 255, 255, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 255, 15, 255, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 255
db 3, 255, 3, 192, 3, 192, 3, 255, 3, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 3, 255, 3, 255, 3, 192, 3, 192
db 3, 255, 3, 255, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 255, 15, 255, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 255, 255
db 255, 255, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 15, 60, 15, 60, 15, 60
db 15, 60, 15, 60, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 255, 255, 255, 255, 3, 192
db 3, 192, 255, 255, 255, 255, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 255, 192, 255, 192
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 3, 255, 3, 255, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 255, 0
db 255, 0, 255, 0, 255, 0, 255, 0, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 0, 255, 0, 255, 0, 255, 0, 255
db 0, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 255, 255, 255, 255, 255, 255, 255, 255, 255, 255
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 243, 240, 243, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 60, 60, 60, 60, 60, 60, 60, 60, 60, 60
db 63, 240, 63, 240, 60, 0, 60, 0, 60, 0
db 60, 0, 255, 0, 255, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 63, 240, 63, 240, 240, 60, 240, 60, 240, 0
db 240, 0, 240, 0, 240, 0, 240, 0, 240, 0
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 63, 252, 63, 252, 51, 204
db 51, 204, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 15, 240
db 15, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 252
db 63, 252, 0, 60, 0, 60, 0, 60, 0, 60
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 15, 240, 15, 240, 3, 192
db 3, 192, 63, 252, 63, 252, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 243, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 63, 252, 63, 252
db 3, 192, 3, 192, 3, 192, 3, 192, 15, 240
db 15, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 60, 240, 60
db 60, 240, 60, 240, 15, 192, 15, 192, 15, 192
db 15, 192, 15, 192, 15, 192, 60, 240, 60, 240
db 240, 60, 240, 60, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 255, 255, 255, 255, 0, 15
db 0, 15, 0, 15, 0, 15, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 63, 252, 63, 252, 0, 60, 0, 60, 0, 60
db 0, 60, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 255, 252, 255, 252, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 243, 60, 243, 60
db 243, 60, 243, 60, 243, 60, 255, 252, 255, 252
db 0, 15, 0, 15, 0, 15, 0, 15, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 255, 192, 255, 192
db 207, 0, 207, 0, 207, 0, 207, 0, 15, 252
db 15, 252, 15, 15, 15, 15, 15, 15, 15, 15
db 63, 252, 63, 252, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 255, 60, 255, 60, 243, 252, 243, 252
db 243, 252, 243, 252, 255, 60, 255, 60, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 255, 0, 255, 0, 60, 0
db 60, 0, 60, 0, 60, 0, 63, 240, 63, 240
db 60, 60, 60, 60, 60, 60, 60, 60, 255, 240
db 255, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 63, 240
db 63, 240, 240, 60, 240, 60, 0, 60, 0, 60
db 15, 252, 15, 252, 0, 60, 0, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 240, 252, 240, 252, 243, 207, 243, 207
db 243, 207, 243, 207, 255, 207, 255, 207, 243, 207
db 243, 207, 243, 207, 243, 207, 240, 252, 240, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 255, 63, 255
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 252
db 63, 252, 15, 60, 15, 60, 60, 60, 60, 60
db 252, 63, 252, 63, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 60, 240, 60, 240, 0, 0, 0, 0, 255, 252
db 255, 252, 60, 60, 60, 60, 60, 12, 60, 12
db 60, 192, 60, 192, 63, 192, 63, 192, 60, 192
db 60, 192, 60, 0, 60, 0, 60, 12, 60, 12
db 60, 60, 60, 60, 255, 252, 255, 252, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 60, 240, 60, 240
db 0, 0, 0, 0, 63, 240, 63, 240, 240, 60
db 240, 60, 240, 60, 240, 60, 255, 240, 255, 240
db 240, 0, 240, 0, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 63, 240, 63, 240
db 240, 60, 240, 60, 240, 0, 240, 0, 240, 192
db 240, 192, 255, 192, 255, 192, 240, 192, 240, 192
db 240, 0, 240, 0, 240, 0, 240, 0, 240, 60
db 240, 60, 63, 240, 63, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 240, 63, 240, 240, 60, 240, 60
db 240, 0, 240, 0, 255, 192, 255, 192, 240, 0
db 240, 0, 240, 60, 240, 60, 63, 240, 63, 240
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 60, 60, 60, 60
db 0, 0, 0, 0, 15, 240, 15, 240, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 15, 240, 15, 240, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 60, 240, 60, 240, 0, 0, 0, 0
db 15, 192, 15, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 3, 192, 3, 192, 3, 192
db 3, 192, 3, 192, 15, 240, 15, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 60, 240, 60, 240, 15, 192
db 15, 192, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 63, 252, 63, 252, 0, 60, 0, 60
db 0, 60, 0, 60, 240, 60, 240, 60, 63, 240
db 63, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 60, 240, 60, 240, 15, 192, 15, 192, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 63, 252
db 63, 252, 0, 60, 0, 60, 0, 60, 0, 60
db 240, 60, 240, 60, 63, 240, 63, 240, 0, 0
db 0, 0, 0, 0, 0, 0, 15, 192, 15, 192
db 60, 240, 60, 240, 60, 240, 60, 240, 15, 192
db 15, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 3, 192, 3, 192, 3, 192
db 3, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 3, 192
db 3, 192, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 252
db 0, 252, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 0, 240, 0, 240
db 0, 240, 0, 240, 0, 240, 252, 240, 252, 240
db 60, 240, 60, 240, 15, 240, 15, 240, 3, 240
db 3, 240, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 240, 255, 240, 255
db 240, 243, 240, 243, 252, 255, 252, 255, 252, 240
db 252, 240, 255, 255, 255, 255, 243, 240, 243, 240
db 243, 240, 243, 240, 240, 240, 240, 240, 240, 240
db 240, 240, 240, 240, 240, 240, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 240, 60, 240, 60, 63, 240
db 63, 240, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 240, 60, 240, 60, 240, 60, 240, 60
db 240, 60, 63, 240, 63, 240, 240, 60, 240, 60
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 63, 252, 63, 252, 63, 252, 63, 252
db 63, 252, 63, 252, 63, 252, 63, 252, 63, 252
db 63, 252, 63, 252, 63, 252, 63, 252, 63, 252
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
db 0, 0, 0, 0

black_text:
dd 0x00CCCCCC, 0x00000000
green_text:
dd 0x00CCCCCC, 0x0000AA00
red_text:
dd 0x00CCCCCC, 0x00AA0000
gray_text:
dd 0x00CCCCCC, 0x00777777

logo:
db 00000000b, 00000000b, 01000000b, 00000000b
db 00000000b, 00000001b, 11000000b, 00000000b
db 00000000b, 00000001b, 00000000b, 00000000b
db 11111111b, 11111111b, 11111111b, 11111111b
db 10000000b, 00000000b, 00000000b, 00000001b
db 10101010b, 10101010b, 10101010b, 01010101b
db 10000000b, 00000000b, 00001010b, 00000001b
db 10101010b, 10101010b, 10100000b, 01010101b
db 10000000b, 00000000b, 00000100b, 00000001b
db 10101010b, 10101010b, 10101110b, 01010101b
db 10000000b, 00000000b, 00000000b, 00000001b
db 11111111b, 11111111b, 11111111b, 11111111b


I_END: