
///===========================================
///
/// Библиотека функций быстрой сортировки
///
///
/// Базовый код был взят с сайта algolist.manual.ru
/// 
/// Скомпоновал А. Богомаз aka Albom (albom85@yandex.ru)
///===========================================


///===========================================
/// Сортировка для переменных типа int (4 байта)
///===========================================
void qsi(int *a, int n);

///===========================================
/// Сортировка для переменных типа short int (2 байта)
///===========================================
void qss(short *a, int n);

///===========================================
/// Сортировка для переменных типа char (1 байт)
///===========================================
void qsc(char *a, int n);

///===========================================
/// Сортировка для переменных типа unsigned int (4 байта)
///===========================================
void qsui(unsigned *a, int n);

///===========================================
/// Сортировка для переменных типа unsigned short int (2 байта)
///===========================================
void qsus(unsigned short *a, int n);

///===========================================
/// Сортировка для переменных типа unsigned char (1 байт)
///===========================================
void qsuc(unsigned char *a, int n);

///===========================================
/// Сортировка для переменных типа float (4 байта)
///===========================================
void qsf(float *a, int n);

///===========================================
/// Сортировка для переменных типа double (8 байт)
///===========================================
void qsd(double *a, int n);
