;Файл программы для PrMK. Скомпилировать с помощью FASM.

; Вычисляем площадь круга
;Ввод данных:
;1. Ввести радиус круга;
;2. Нажать [В/О] [С/П];
;3. На индикаторе - площадь круга.


db "<СТЕК>"

	 ;далее следуют значения регистров стека (только qword)

		 ;R.X1
		  dq 0.0
		 ;R.X
		  dq 2.0
		 ;R.Y
		  dq 0.0
		 ;R.Z
		  dq 0.0
		 ;R.T
		  dq 0.0

db "<РГСТ>"

		;Регистры: (с R.0 по R.E)

		  times 15 dq 0.0

db "<ПРГМ>"
		;Программа в ОПКОДах МК

db 0x22,0x20,0x12,0x50,0x51,0x00