;Файл программы для PrMK. Скомпилировать с помощью FASM.

;Игра "крестики-нолики" 
;Перепечатано с книги "Игры с микро ЭВМ" Я.К.Трохименко. Киев. "Технiка", 1986

;Установить переключатель Р-Г в положение Р, нажать клавиши В/О и С/П для высвечивания номера РX=9 центральной клетки, "занимаемой" микрокалькулятором; после каждого высвечивания номера клетки, "занимаемой" микрокалькулятором, вводить в регистр X номер клетки, "занимаемой" противником, и нажимать только клавишу С/П; при выигрыше микрокалькулятора высвечиваются цифры 77 (номер клетки, "занимаемой" последним ходом микрокалькулятора, хранится в регистре Y); при ничейном результате высвечивается нуль.

;Номера клеток поля:

;  1  |  2  |  3
;-----------------
;  8  |  9  |  4
;-----------------
;  7  |  6  |  5


db "<СТЕК>"

	 ;далее следуют значения регистров стека (только qword)

		 ;R.X1
		  dq 0.0
		 ;R.X
		  dq 0.0
		 ;R.Y
		  dq 0.0
		 ;R.Z
		  dq 0.0
		 ;R.T
		  dq 0.0

db "<РГСТ>"

		;Регистры: (с R.0 по R.E)

		  times 15 dq 0.0

db "<ПРГМ>"
		;Программа в ОПКОДах МК

db 0x0E,0x09,0x50,0x53,0x19,0x20,0x12,0x1D,0x5C,0x11
db 0x69,0x53,0x19,0x01,0x11,0x51,0x30,0x67,0x53,0x19
db 0x67,0x53,0x19,0x00,0x50,0x01,0x11,0x5E,0x1E,0x08
db 0x49,0x50,0x47,0x69,0x04,0x11,0x57,0x28,0x5C,0x2A
db 0x08,0x10,0x48,0x67,0x11,0x57,0x33,0x68,0x07,0x07
db 0x50,0x69,0x52