

byte unicode_chars[] = "€‚ƒ„…†‡‰‹‘’“”•–—™› ΅Ά£¤¥¦§¨©ª«¬­®―ΰαβγδεζηθικλμνξοπρh£\243i\105\244\0";

/*	IF (BL==178) ESBYTE[ESI] = 73;  //I
	IF (BL==179) ESBYTE[ESI] = 105; //i
	IF (BL==175) ESBYTE[ESI] = 244; //J
    IF (BL==191) ESBYTE[ESI] = 245; //j
	IF (BL==170) ESBYTE[ESI] = 242; //E
	IF (BL==186) ESBYTE[ESI] = 243; //e
    IF (BL==168) ESBYTE[ESI] = 240; //ΰ
    IF (BL==184) ESBYTE[ESI] = 'e'; //e
	IF (BL==180) ESBYTE[ESI] = 254; //£
    IF ((BL==147) || (BL==148) || (BL==171) || (BL==187)) ESBYTE[ESI] = 34;
    IF ((BL==150) || (BL==151)) ESBYTE[ESI] = 45;
*/

char *unicode_tags[]={
"nbsp",  " ",
"#38",   " ",
"#160",  " ",

"copy",  "(c)",
"#169",  "(c)",

"trade", "[TM]",

"reg",   "(r)",
"#174",  "(r)",

"bdquo", ",,",

"amp",   "&",
"#38",   "&",

"lt",    "<",
"#60",   "<",

"gt",    ">",
"#62",   ">",

"minus", "-",
"ndash", "-",
"mdash", "-", //--
"#8722", "-",
"#8211", "-",
"#151",  "-",
"#149",  "-",

"rsquo", "'",
"#39",   "'",
"#96",   "'",
"#8217", "'",

"quot",  "\"",
"#34",   "\"",
"ldquo", "\"",
"rdquo", "\"",
"#8222", "\"",
"#8221", "\"",

"laquo", "<<",
"#171",  "<<",
"raquo", ">>",
"#187",  ">>",

"uarr",  "\24",
"darr",  "\25",
"rarr",  "\26",
"larr",  "\27", 

"#1028", "\242",
"#1030", "I",
"#1031", "\244",

"#8470", "N",
"bull",  "-", //Ά®®΅ι¥ §¤¥αμ β®ηª 
"percnt","%",

0}; 
