;lang equ ru

include 'obj_codes.inc'

macro ObjOpt id,bl_type,graph,info,caption,Col,img,bit_prop
{
dd id
db bl_type
db graph
@@: db info
rb @b+30-$
@@: db caption
rb @b+MAX_OPT_CAPTION-$
dw Col
dw img ;индексы картинок (в файле 'icon.bmp')
dd bit_prop+0
}

ObjOpt C_TDF,  0,0,'Тип данного','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 3, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_VAR,  0,0,'Переменная','имя переменной*значение по умолчанию*комментарий',\
	<40, 80,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 0, -1,  5, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_STR,  1,0,'Структура','имя структуры*параметры для макроса',\
	<40,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_ACO,  1,0,'Авто код','',\
	<0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<2, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>,\
	txt_bit_auto
ObjOpt C_BUT,  1,1,'Кнопка','идентификатор*отступ слева*отступ сверху*ширина*высота*цвет*имя метки при нажатии',\
	<20, 40, 60, 80,100,120,  0,  0,  0,  0, 0>,\
	<29, 15, 16, 26, 27, 25, -1, -1, -1, -1,-1>,\
	txt_bit_but
ObjOpt C_EDB,  1,1,'Текстовое поле',\
	'имя структуры editbox*ширина поля*отступ слева*отступ сверху*цвет фона*цвет выделения при удерживании shift или мышкой*цвет рамки*цвет рамки при неактивном поле*цвет текста*максимальная длина текста*начальный текст',\
	<30, 40, 50, 60, 80,100,120,140,160,170, 0>,\
	<10, 26, 15, 16, 25, 25, 25, 25, 25, -1, 4>,\
	txt_bit_edit
ObjOpt C_OPT,  1,1,'Радио кнопка','имя*отступ слева*отступ сверху*цвет фона внутри*цвет рамки и внутр. галочки*цвет текста*подпись*отступ до надписи*размер квадрата',\
	<40, 50, 60, 80,100,120,180,190,  0,  0, 0>,\
	< 9, 15, 16, 25, 25, 25,  4, 26, 27, -1, -1>
ObjOpt C_CHB,  1,1,'Флажок','***подпись*цвет фона внутри*цвет рамки и внутр. галочки*цвет текста*отступ до надписи*размер квадрата',\
	<40, 50, 60,120,140,160,180,190,  0,  0, 0>,\
	< 8, 15, 16,  4, 25, 25, 25, 26, 27, -1, -1>,\
	txt_bit_che
ObjOpt C_TXT,  1,0,'asm код','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<11, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_WND,  1,1,'Окно','заголовок окна*стиль окна*отступ слева*отступ сверху*ширина*высота*цвет клиентской области*цвет заголовка (если есть)',\
	<98,100,110,120,130,150,170,  0,  0,  0, 0>,\
	<12, -1, 15, 16, 26, 27, 25, 25, -1, -1, -1>,\
	txt_bit_wnd
ObjOpt C_COM,  1,0,'Комментарий','строка комментария',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 5, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_INC,  1,0,'Включение файла','имя файла*комментарий',\
	<100, 0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 6,  5, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_LIB,  1,0,'Импорт библиотеки','имя библ.*сист. дир.*метка импорта*приставка*ошибка не найдена*ошибка не могу открыть',\
	<30, 80,110,120,160,  0,  0,  0,  0,  0, 0>,\
	<20, -1, -1, -1,  4,  4, -1, -1, -1, -1, -1>
ObjOpt C_IFN,  1,0,'Функция из библиотеки','програмное имя функции*импортируемое имя функции',\
	<100, 0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<21, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_DTT,  1,1,'Рисование текста','текстовая строка*координата по x*координата по y*цвет текста*цвет фона (если есть)',\
	<40, 50, 60, 80,  0,  0,  0,  0,  0,  0, 0>,\
	< 4, 15, 16, 25, 25, -1, -1, -1, -1, -1, -1>,\
	txt_bit_caption
ObjOpt C_REC,  1,1,'Прямоугольник','цвет*отступ слева*отступ сверху*ширина*высота',\
	<20, 40, 60, 80,  0,  0,  0,  0,  0,  0, 0>,\
	<25, 15, 16, 26, 27, -1, -1, -1, -1, -1, -1>
ObjOpt C_KEY,  1,0,'Событие на клавиатуру','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<28, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt 0x0d,  1,0, '-','',\
	<20,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>

dd 0 ;разделитель

;названия битовых свойств
txt_bit_auto db 'подключения файлов',0
	db 'события от мыши',0
	db 'коды элементов',0
	db 'нажатия на кнопки',0
	db 0
txt_bit_wnd db 'подпись окна',0
	db 'окно не закрашивает клиентскую обл.',0
	db 'коорд. относительно клиентской обл.',0
	db 'градиентная заливка раб. обл.',0
	db 0
txt_bit_edit db 'в фокусе',0
	db 'цифры от 0-9',0
	db 0
txt_bit_che db 'check_box выбран',0
	db 0
txt_bit_but db 'не рисовать кнопку',0
	db 'не рисовать границу при нажатии',0
	db 0
txt_bit_caption db 'строка ASCII заканч. 0',0
	db 'заливка фона',0
	db '2-й шрифт',0
	db 0


