;lang equ ru

MAX_LEN_OBJ_TXT equ 200

C_TD equ 't' ;typedef
C_AC equ 'a' ;автоматические коды (auto code)
C_ST equ 's' ;struct
C_IN equ '#' ;include
C_TT equ 'd' ;блок кода (данных)
C_VR equ '-' ;переменная
C_CO equ ';' ;комментарий
C_WI equ 'w' ;окно
C_CB equ 'c' ;CheckBox
C_OP equ 'o' ;OptionBox
C_ED equ 'e' ;EditBox
C_BU equ 'b' ;Button
C_DT equ 'x' ;рисовать текст
C_RE equ 'r' ;рисовать прямоугольник
C_KE equ 'k' ;клавиатура
C_LIB equ 'l'
C_IFN equ 'f'

macro ObjOpt c,bl_type,graph,info,caption,Col,img
{
db c
db bl_type
db graph
@@: db info
rb @b+30-$
@@: db caption
rb @b+MAX_LEN_OBJ_TXT-$
dw Col
dw img
}

ObjOpt C_TD,  0,0,'Тип данного','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 3, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_VR,  0,0,'Переменная','имя переменной*значение по умолчанию*комментарий',\
	<40, 80,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 0, -1,  5, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_ST,  1,0,'Структура','имя структуры*параметры для макроса',\
	<40,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_AC,  1,0,'Авто код','',\
	<0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<2, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_BU,  1,1,'Кнопка','идентификатор*отступ слева*отступ сверху*ширина*высота*цвет*имя метки при нажатии',\
	<20, 40, 60, 80,100,120,  0,  0,  0,  0, 0>,\
	<29, 15, 16, 26, 27, 25, -1, -1, -1, -1,-1>
ObjOpt C_ED,  1,1,'Текстовое поле','***отступ сверху*цвет фона*цвет выделения при удерживании shift или мышкой*цвет рамки*при неактивном боксе цвет рамки*цвет текста*максимальная длина текста*начальный текст',\
	<30, 40, 50, 60, 80,100,120,140,160,170, 0>,\
	<10, 26, 15, 16, 25, 25, 25, 25, 25, -1, 4>
ObjOpt C_OP,  1,1,'Радио кнопка','имя*отступ слева*отступ сверху*цвет фона внутри*цвет рамки и внутр. галочки*цвет текста*подпись*отступ до надписи*размер квадрата',\
	<40, 50, 60, 80,100,120,180,190,  0,  0, 0>,\
	< 9, 15, 16, 25, 25, 25,  4, 26, 27, -1, -1>
ObjOpt C_CB,  1,1,'Флажок','***подпись*цвет фона внутри*цвет рамки и внутр. галочки*цвет текста*отступ до надписи*размер квадрата',\
	<40, 50, 60,120,140,160,180,190,  0,  0, 0>,\
	< 8, 15, 16,  4, 25, 25, 25, 26, 27, -1, -1>
ObjOpt C_TT,  1,0,'asm код','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<11, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_WI,  1,1,'Окно','**отступ слева*отступ сверху*ширина*высота*цвет клиентской области*цвет заголовка (если есть)',\
	<98,100,110,120,130,150,170,  0,  0,  0, 0>,\
	<12, -1, 15, 16, 26, 27, 25, 25, -1, -1, -1>
ObjOpt C_CO,  1,0,'Комментарий','строка комментария',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 5, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_IN,  1,0,'Включение файла','имя файла*комментарий',\
	<100, 0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	< 6,  5, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_LIB,  1,0,'Импорт библиотеки','имя библ.*сист. дир.*метка импорта*приставка*ошибка не найдена*ошибка не могу открыть',\
	<30, 80,110,120,160,  0,  0,  0,  0,  0, 0>,\
	<20, -1, -1, -1,  4,  4, -1, -1, -1, -1, -1>
ObjOpt C_IFN,  1,0,'Функция из библиотеки','програмное имя функции*импортируемое имя функции',\
	<100, 0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<21, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt C_DT,  1,1,'Рисование текста','***цвет текста*цвет фона (если есть)',\
	<40, 50, 60, 80,  0,  0,  0,  0,  0,  0, 0>,\
	< 4, 15, 16, 25, 25, -1, -1, -1, -1, -1, -1>
ObjOpt C_RE,  1,1,'Прямоугольник','цвет*отступ слева*отступ сверху*ширина*высота',\
	<20, 40, 60, 80,  0,  0,  0,  0,  0,  0, 0>,\
	<25, 15, 16, 26, 27, -1, -1, -1, -1, -1, -1>
ObjOpt C_KE,  1,0,'Событие на клавиатуру','',\
	< 0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<28, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>
ObjOpt 0x0d,  1,0, '-','',\
	<20,  0,  0,  0,  0,  0,  0,  0,  0,  0, 0>,\
	<-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1>



